app/controllers/buildings_controller.rb

SELECT `buildings`.* FROM `buildings`
---
  def index
    @buildings = Building.all

INSERT INTO `buildings` (`name`, `country`, `prefecture`, `city`, `detail_address`, `latitude`, `longitude`, `created_at`, `updated_at`) VALUES ('竹本', '日本', '埼玉県', '川越市', '古谷上6083-8', 35.9161423, 139.5351197, '2019-01-19 08:04:08', '2019-01-19 08:04:08')
---
  def create
    @building = Building.new(create_params)

    if @building.save