app/controllers/locations_controller.rb

SELECT `buildings`.* FROM `buildings`
---
  def index
    render json: { loc: Building.all }

SELECT  `buildings`.* FROM `buildings` WHERE `buildings`.`id` = 23 LIMIT 1
UPDATE `buildings` SET `latitude` = 34.8276894297801, `longitude` = 138.96388259887692, `address` = 'Unnamed Road, 梨本 河津町 賀茂郡 静岡県 413-0501 日本', `updated_at` = '2019-01-21 13:40:18' WHERE `buildings`.`id` = 1
---
  def update
    building = Building.find(params[:id])

    if building.update(latitude: update_params[:lat], longitude: update_params[:lng])